tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2585_tdd.h
#define B3D22                         1649
#define B3D23                         1650
#define B3D24                         1651
#define B3D25                         1652
#define B3D26                         1653
#define B3D27                         1654
#define B3D3                          1655
#define B3D30                         1656
#define B3D31                         1657
#define B3D32                         1658
#define B3D33                         1659
#define B3D34                         1660
#define B3D35                         1661
#define B3D36                         1662
#define B3D37                         1663
#define B3D4                          1664
#define B3D40                         1665
#define B3D41                         1666
#define B3D42                         1667
#define B3D43                         1668
#define B3D44                         1669
#define B3D45                         1670
#define B3D46                         1671
#define B3D47                         1672
#define B3D5                          1673
#define B3D50                         1674
#define B3D51                         1675
#define B3D52                         1676
#define B3D53                         1677
#define B3D54                         1678
#define B3D55                         1679
#define B3D56                         1680
#define B3D57                         1681
#define B3D6                          1682
#define B3D60                         1683
#define B3D61                         1684
#define B3D62                         1685
#define B3D63                         1686
#define B3D64                         1687
#define B3D65                         1688
#define B3D66                         1689
#define B3D67                         1690
#define B3D7                          1691
#define B3D70                         1692
#define B3D71                         1693
#define B3D72                         1694
#define B3D73                         1695
#define B3D74                         1696
#define B3D75                         1697
#define B3D76                         1698
#define B3D77                         1699
#define CANSTAT_RO6                   1700
#define CANSTAT_RO6_EICODE0           1701
#define CANSTAT_RO6_ICODE0            1702
#define CANSTAT_RO6_ICODE1            1703
#define CANSTAT_RO6_EICODE1_ICODE0    1704
#define CANSTAT_RO6_EICODE2_ICODE1    1705
#define CANSTAT_RO6_ICODE2            1706
#define CANSTAT_RO6_EICODE3_ICODE2    1707
#define CANSTAT_RO6_ICODE3            1708
#define CANSTAT_RO6_EICODE4           1709
#define CANSTAT_RO6_ICODE4            1710
#define CANSTAT_RO6_OPMODE0           1711
#define CANSTAT_RO6_OPMODE1           1712
#define CANSTAT_RO6_OPMODE2           1713
#define CANCON_RO6                    1714
#define CANCON_RO6_FP0                1715
#define CANCON_RO6_WIN0               1716
#define CANCON_RO6_WIN0_FP1           1717
#define CANCON_RO6_WIN1_FP2           1718
#define CANCON_RO6_WIN1               1719
#define CANCON_RO6_WIN2               1720
#define CANCON_RO6_WIN2_FP3           1721
#define CANCON_RO6_ABAT               1722
#define CANCON_RO6_REQOP0             1723
#define CANCON_RO6_REQOP1             1724
#define CANCON_RO6_REQOP2             1725
#define B4CON                         1726
#define B4CON_TXPRI0                  1727
#define B4CON_FILHIT0_TXPRI0          1728
#define B4TXPRI0                      1729
#define B4CON_FILHIT0                 1730
#define B4FILHIT0                     1731
#define B4CON_FILHIT1                 1732
#define B4CON_TXPRI1                  1733
#define B4CON_FILHIT1_TXPRI1          1734
#define B4TXPRI1                      1735
#define B4FILHIT1                     1736
#define B4CON_RTREN                   1737
#define B4CON_FILHIT2                 1738
#define B4RTREN                       1739
#define B4FILHIT2                     1740
#define B4CON_FILHIT2_RTREN           1741
#define B4CON_TXREQ                   1742
#define B4TXREQ                       1743
#define B4CON_FILHIT3_TXREQ           1744
#define B4CON_FILHIT3                 1745
#define B4FILHIT3                     1746
#define B4CON_TXERR                   1747
#define B4CON_FILHIT4_TXERR           1748
#define B4TXERR                       1749
#define B4CON_FILHIT4                 1750
#define B4FILHIT4                     1751
#define B4CON_TXLARB                  1752
#define B4TXLARB                      1753
#define B4CON_RXRTRRO_TXLARB          1754
#define B4CON_RTRRO                   1755
#define B4RTRRO                       1756
#define B4CON_RXRTRRO                 1757
#define B4TXABT                       1758
#define B4CON_RXM1_TXABT              1759
#define B4CON_RXM1                    1760
#define B4CON_TXABT                   1761
#define B4RXM1                        1762
#define B4CON_TXBIF                   1763
#define B4CON_RXFUL_TXBIF             1764
#define B4TXB3IF                      1765
#define B4RXFUL                       1766
#define B4CON_RXFUL                   1767
#define B4SIDH                        1768
#define B4SIDH_SID3                   1769
#define B4SID3                        1770
#define B4SID4                        1771
#define B4SIDH_SID4                   1772
#define B4SID5                        1773
#define B4SIDH_SID5                   1774
#define B4SIDH_SID6                   1775
#define B4SID6                        1776
#define B4SID7                        1777
#define B4SIDH_SID7                   1778
#define B4SID8                        1779
#define B4SIDH_SID8                   1780
#define B4SID9                        1781
#define B4SIDH_SID9                   1782
#define B4SIDH_SID10                  1783
#define B4SID10                       1784
#define B4SIDL                        1785
#define B4EID16                       1786
#define B4SIDL_EID16                  1787
#define B4EID17                       1788
#define B4SIDL_EID17                  1789
#define B4EXIDE                       1790
#define B4SIDL_EXID                   1791
#define B4SIDL_EXIDE                  1792
#define B4EXID                        1793
#define B4SIDL_SRR                    1794
#define B4SRR                         1795
#define B4SIDL_SID0                   1796
#define B4SID0                        1797
#define B4SIDL_SID1                   1798
#define B4SID1                        1799
#define B4SIDL_SID2                   1800
#define B4SID2                        1801
#define B4EIDH                        1802
#define B4EID8                        1803
#define B4EIDH_EID8                   1804
#define B4EID9                        1805
#define B4EIDH_EID9                   1806
#define B4EID10                       1807
#define B4EIDH_EID10                  1808
#define B4EID11                       1809
#define B4EIDH_EID11                  1810
#define B4EID12                       1811
#define B4EIDH_EID12                  1812
#define B4EID13                       1813
#define B4EIDH_EID13                  1814
#define B4EID14                       1815
#define B4EIDH_EID14                  1816
#define B4EID15                       1817
#define B4EIDH_EID15                  1818
#define B4EIDL                        1819
#define B4EID0                        1820
#define B4EIDL_EID0                   1821
#define B4EID1                        1822
#define B4EIDL_EID1                   1823
#define B4EID2                        1824
#define B4EIDL_EID2                   1825
#define B4EID3                        1826
#define B4EIDL_EID3                   1827
#define B4EID4                        1828
#define B4EIDL_EID4                   1829
#define B4EID5                        1830
#define B4EIDL_EID5                   1831
#define B4EID6                        1832
#define B4EIDL_EID6                   1833
#define B4EID7                        1834
#define B4EIDL_EID7                   1835
#define B4DLC                         1836
#define B4DLC_DLC0                    1837
#define B4DLC0                        1838
#define B4DLC_DLC1                    1839
#define B4DLC1                        1840
#define B4DLC_DLC2                    1841
#define B4DLC2                        1842
#define B4DLC_DLC3                    1843
#define B4DLC3                        1844
#define B4DLC_RESRB0                  1845
#define B4RB0                         1846
#define B4DLC_RB0                     1847
#define B4DLC_RESRB1                  1848
#define B4DLC_RB1                     1849
#define B4RB1                         1850
#define B4DLC_RXRTR_TXRTR             1851
#define B4RXRTR                       1852
#define B4DLC_RXRTR                   1853
#define B4DLC_TXRTR                   1854
#define B4D0                          1855
#define B4D00                         1856
#define B4D01                         1857
#define B4D02                         1858
#define B4D03                         1859
#define B4D04                         1860
#define B4D05                         1861
#define B4D06                         1862
#define B4D07                         1863
#define B4D1                          1864
#define B4D10                         1865
#define B4D11                         1866
#define B4D12                         1867
#define B4D13                         1868
#define B4D14                         1869
#define B4D15                         1870
#define B4D16                         1871
#define B4D17                         1872
#define B4D2                          1873
#define B4D20                         1874
#define B4D21                         1875
#define B4D22                         1876
#define B4D23                         1877
#define B4D24                         1878
#define B4D25                         1879
#define B4D26                         1880
#define B4D27                         1881
#define B4D3                          1882
#define B4D30                         1883
#define B4D31                         1884
#define B4D32                         1885
#define B4D33                         1886
#define B4D34                         1887
#define B4D35                         1888
#define B4D36                         1889
#define B4D37                         1890
#define B4D4                          1891
#define B4D40                         1892
#define B4D41                         1893
#define B4D42                         1894
#define B4D43                         1895
#define B4D44                         1896
#define B4D45                         1897
#define B4D46                         1898
#define B4D47                         1899
#define B4D5                          1900
#define B4D50                         1901
#define B4D51                         1902
#define B4D52                         1903
#define B4D53                         1904
#define B4D54                         1905
#define B4D55                         1906
#define B4D56                         1907
#define B4D57                         1908
#define B4D6                          1909
#define B4D60                         1910
#define B4D61                         1911
#define B4D62                         1912
#define B4D63                         1913
#define B4D64                         1914
#define B4D65                         1915
#define B4D66                         1916
#define B4D67                         1917
#define B4D7                          1918
#define B4D70                         1919
#define B4D71                         1920
#define B4D72                         1921
#define B4D73                         1922
#define B4D74                         1923
#define B4D75                         1924
#define B4D76                         1925
#define B46D77                        1926
#define B4D77                         1927
#define CANSTAT_RO5                   1928
#define CANSTAT_RO5_ICODE0            1929
#define CANSTAT_RO5_EICODE0           1930
#define CANSTAT_RO5_ICODE1            1931
#define CANSTAT_RO5_EICODE1_ICODE0    1932
#define CANSTAT_RO5_ICODE2            1933
#define CANSTAT_RO5_EICODE2_ICODE1    1934
#define CANSTAT_RO5_ICODE3            1935
#define CANSTAT_RO5_EICODE3_ICODE2    1936
#define CANSTAT_RO5_ICODE4            1937
#define CANSTAT_RO5_EICODE4           1938
#define CANSTAT_RO5_OPMODE0           1939
#define CANSTAT_RO5_OPMODE1           1940
#define CANSTAT_RO5_OPMODE2           1941
#define CANCON_RO5                    1942
#define CANCON_RO5_FP0                1943
#define CANCON_RO5_WIN0_FP1           1944
#define CANCON_RO5_WIN0               1945
#define CANCON_RO5_WIN1               1946
#define CANCON_RO5_WIN1_FP2           1947
#define CANCON_RO5_WIN2_FP3           1948
#define CANCON_RO5_WIN2               1949
#define CANCON_RO5_ABAT               1950
#define CANCON_RO5_REQOP0             1951
#define CANCON_RO5_REQOP1             1952
#define CANCON_RO5_REQOP2             1953
#define B5CON                         1954
#define B5CON_FILHIT0_TXPRI0          1955
#define B5FILHIT0                     1956
#define B5TXPRI0                      1957
#define B5CON_TXPRI0                  1958
#define B5CON_FILHIT0                 1959
#define B5CON_FILHIT1_TXPRI1          1960
#define B5FILHIT1                     1961
#define B5TXPRI1                      1962
#define B5CON_TXPRI1                  1963
#define B5CON_FILHIT1                 1964
#define B5CON_FILHIT2_RTREN           1965
#define B5CON_FILHIT2                 1966
#define B5FILHIT2                     1967
#define B5CON_RTREN                   1968
#define B5RTREN                       1969
#define B5TXREQ                       1970
#define B5CON_TXREQ                   1971
#define B5CON_FILHIT3_TXREQ           1972
#define B5FILHIT3                     1973
#define B5CON_FILHIT3                 1974
#define B5CON_TXERR                   1975
#define B5FILHIT4                     1976
#define B5CON_FILHIT4                 1977
#define B5TXERR                       1978
#define B5CON_FILHIT4_TXERR           1979
#define B5RTRRO                       1980
#define B5CON_RXRTRRO_TXLARB          1981
#define B5CON_RXRTRRO                 1982
#define B5CON_TXLARB                  1983
#define B5TXLARB                      1984
#define B5CON_RTRRO                   1985
#define B5RXM1                        1986
#define B5CON_RXM1_TXABT              1987
#define B5TXABT                       1988
#define B5CON_RXM1                    1989
#define B5CON_TXABT                   1990
#define B5CON_RXFUL                   1991
#define B5CON_TXBIF                   1992
#define B5TXBIF                       1993
#define B5CON_RXFUL_TXBIF             1994
#define B5RXFUL                       1995
#define B5SIDH                        1996
#define B5SIDH_SID3                   1997
#define B5SID3                        1998
#define B5SIDH_SID4                   1999
#define B5SID4                        2000
#define B5SIDH_SID5                   2001
#define B5SID5                        2002
#define B5SIDH_SID6                   2003
#define B5SID6                        2004
#define B5SIDH_SID7                   2005
#define B5SID7                        2006
#define B5SIDH_SID8                   2007
#define B5SID8                        2008
#define B5SIDH_SID9                   2009
#define B5SID9                        2010
#define B5SID10                       2011
#define B5SIDH_SID10                  2012
#define B5SIDL                        2013
#define B5SIDL_EID16                  2014
#define B5EID16                       2015
#define B5SIDL_EID17                  2016
#define B5EID17                       2017
#define B5SIDL_EXIDEN                 2018
#define B5EXID                        2019
#define B5EXIDE                       2020
#define B5SIDL_EXIDE                  2021
#define B5SIDL_EXID                   2022
#define B5SIDL_SRR                    2023
#define B5SRR                         2024
#define B5SID0                        2025
#define B5SIDL_SID0                   2026
#define B5SID1                        2027
#define B5SIDL_SID1                   2028
#define B5SID2                        2029
#define B5SIDL_SID2                   2030
#define B5EIDH                        2031
#define B5EIDH_EID8                   2032
#define B5EID8                        2033
#define B5EIDH_EID9                   2034
#define B5EID9                        2035
#define B5EIDH_EID10                  2036
#define B5EID10                       2037
#define B5EIDH_EID11                  2038
#define B5EID11                       2039
#define B5EIDH_EID12                  2040
#define B5EID12                       2041
#define B5EIDH_EID13                  2042
#define B5EID13                       2043
#define B5EIDH_EID14                  2044
#define B5EID14                       2045
#define B5EIDH_EID15                  2046
#define B5EID15                       2047
#define B5EIDL                        2048
#define B5EID0                        2049
#define B5EIDL_EID0                   2050
#define B5EID1                        2051
#define B5EIDL_EID1                   2052
#define B5EID2                        2053
#define B5EIDL_EID2                   2054
#define B5EID3                        2055
#define B5EIDL_EID3                   2056
#define B5EID4                        2057
#define B5EIDL_EID4                   2058
#define B5EID5                        2059
#define B5EIDL_EID5                   2060
#define B5EID6                        2061
#define B5EIDL_EID6                   2062
#define B5EID7                        2063
#define B5EIDL_EID7                   2064
#define B5DLC                         2065
#define B5DLC0                        2066
#define B5DLC_DLC0                    2067
#define B5DLC1                        2068
#define B5DLC_DLC1                    2069
#define B5DLC2                        2070
#define B5DLC_DLC2                    2071
#define B5DLC3                        2072
#define B5DLC_DLC3                    2073
#define B5DLC_RESRB0                  2074
#define B5DLC_RB0                     2075
#define B5RB0                         2076
#define B5DLC_RESRB1                  2077
#define B5DLC_RB1                     2078
#define B5RB1                         2079
#define B5DLC_RXRTR                   2080
#define B5DLC_RXRTR_TXRTR             2081
#define B5RXRTR                       2082
#define B5D0                          2083
#define B5D00                         2084
#define B5D01                         2085
#define B5D02                         2086
#define B5D03                         2087
#define B5D04                         2088
#define B5D05                         2089
#define B5D06                         2090
#define B5D07                         2091
#define B57D07                        2092
#define B5D1                          2093
#define B5D10                         2094
#define B5D11                         2095
#define B5D12                         2096
#define B5D13                         2097
#define B5D14                         2098
#define B5D15                         2099
#define B5D16                         2100
#define B5D17                         2101
#define B5D2                          2102
#define B5D20                         2103
#define B5D21                         2104
#define B5D22                         2105
#define B57D23                        2106
#define B5D23                         2107
#define B5D24                         2108
#define B5D25                         2109
#define B5D26                         2110
#define B5D27                         2111
#define B5D3                          2112
#define B5D30                         2113
#define B5D31                         2114
#define B5D32                         2115
#define B5D33                         2116
#define B5D34                         2117
#define B5D35                         2118
#define B5D36                         2119
#define B5D37                         2120
#define B5D4                          2121
#define B5D40                         2122
#define B5D41                         2123
#define B5D42                         2124
#define B5D43                         2125
#define B5D44                         2126
#define B5D45                         2127
#define B5D46                         2128
#define B5D47                         2129
#define B5D5                          2130
#define B5D50                         2131
#define B5D51                         2132
#define B5D52                         2133
#define B5D53                         2134
#define B5D54                         2135
#define B5D55                         2136
#define B5D56                         2137
#define B5D57                         2138
#define B5D6                          2139
#define B5D60                         2140
#define B5D61                         2141
#define B5D62                         2142
#define B5D63                         2143
#define B5D64                         2144
#define B5D65                         2145
#define B5D66                         2146
#define B5D67                         2147
#define B5D7                          2148
#define B5D70                         2149
#define B5D71                         2150
#define B5D72                         2151
#define B5D73                         2152
#define B5D74                         2153
#define B5D75                         2154
#define B5D76                         2155
#define B5D77                         2156
#define CANSTAT_RO4                   2157
#define CANSTAT_RO4_EICODE0           2158
#define CANSTAT_RO4_ICODE0            2159
#define CANSTAT_RO4_EICODE1_ICODE0    2160
#define CANSTAT_RO4_ICODE1            2161
#define CANSTAT_RO4_EICODE2_ICODE1    2162
#define CANSTAT_RO4_ICODE2            2163
#define CANSTAT_RO4_EICODE3_ICODE2    2164
#define CANSTAT_RO4_ICODE3            2165
#define CANSTAT_RO4_EICODE4           2166
#define CANSTAT_RO4_ICODE4            2167
#define CANSTAT_RO4_OPMODE0           2168
#define CANSTAT_RO4_OPMODE1           2169
#define CANSTAT_RO4_OPMODE2           2170
#define CANCON_RO4                    2171
#define CANCON_RO4_FP0                2172
#define CANCON_RO4_WIN0_FP1           2173
#define CANCON_RO4_WIN0               2174
#define CANCON_RO4_WIN1_FP2           2175
#define CANCON_RO4_WIN1               2176
#define CANCON_RO4_WIN2_FP3           2177
#define CANCON_RO4_WIN2               2178
#define CANCON_RO4_ABAT               2179
#define CANCON_RO4_REQOP0             2180
#define CANCON_RO4_REQOP1             2181
#define CANCON_RO4_REQOP2             2182
#define RXF0SIDH                      2183
#define RXF0SID3                      2184
#define RXF0SIDH_SID3                 2185
#define RXF0SID4                      2186
#define RXF0SIDH_SID4                 2187
#define RXF0SID5                      2188
#define RXF0SIDH_SID5                 2189
#define RXF0SID6                      2190
#define RXF0SIDH_SID6                 2191
#define RXF0SID7                      2192
#define RXF0SIDH_SID7                 2193
#define RXF0SID8                      2194
#define RXF0SIDH_SID8                 2195
#define RXF0SID9                      2196
#define RXF0SIDH_SID9                 2197
#define RXF0SID10                     2198
#define RXF0SIDH_SID10                2199
#define RXF0SIDL                      2200
#define RXF0SIDL_EID16                2201
#define RXF0EID16                     2202
#define RXF0SIDL_EID17                2203
#define RXF0EID17                     2204
#define RXF0EXIDEN                    2205
#define RXF0SIDL_EXIDE                2206
